[Common]
FolderName=Wiz.StackEdit
AppName=Wiz.StackEdit
AppName_2052=StackEdit Markdown编辑器
AppName_1028=StackEdit Markdown编辑器
AppGUID={c02690da-1da7-48a9-bef4-c80e4795c2df}
;AppType=Display似乎也可以
AppType=Editor
AppVersion=1.0
PluginCount=2
;可以不填
SupportVersion=2

;第一个会在编辑菜单右边的箭头下面添加一个菜单：使用MathJax语法渲染。当用户点击这个菜单后，将会标记这个笔记，需要使用MathJax来渲染。
[Plugin_0]
MenuType=Editor
Caption=Wiz.StackEdit
Caption_2052=StackEdit Markdown编辑器
Caption_1028=StackEdit Markdown编辑器
GUID={16f9df94-798c-4c0d-b0ab-bcf9a1c05264}
Type=ExecuteScript
ScriptFileName=StackEdit.js

;第二个插件功能，是一个全局插件，我们需要监听为知笔记打开笔记的消息，在合适的时候，使用MathJax来渲染公式。
[Plugin_1]
Caption=Edit Markdown By Wiz.StackEdit
Caption_2052=Edit Markdown By Wiz.StackEdit
Caption_1028=Edit Markdown By Wiz.StackEdit
GUID={8c98173a-c7be-4249-a97d-ab25221d4edb}
ScriptFileName=StackEdit_global.js
Type=Global

